<?php

require_once 'User.php';
// __SET | __GET | __ISSET | __UNSET 



$user = new User(); // اللي فوق Dependencyدا الكلاس الي محتاج ال 

$user->FristName = 'mohamed'; //(Overloading)بضيف بروبرتي جديد ولكن من بره الكلاس واسمها عمليه 
$user->lastName = 'mahmoud'; //(Overloading)بضيف بروبرتي جديد ولكن من بره الكلاس واسمها عمليه 
$user->sayed = 2; // هتطبع عشان من نوع برايفت فا مش هتشوف سيد اللي ف ملف اليوزر
$user->ahmed = 33;  // مش هتطبع عشان من نوع بابلك فا هتقوم بتخزين الناتج في احمد اللي ف ملف اليوزر
$user->ahmed = 33;  // مش هتطبع عشان من نوع بابلك فا هتقوم بتخزين الناتج في احمد اللي ف ملف اليوزر


// var_dump($user);
// var_dump($user->asd);//ل بروبرتي مش موجوده Access ايرور عشان كدا بتحاول تعمل  
// var_dump($user->sayed);//ل بروبرتي من نوع برايقت Access ايرور عشان كدا بتحاول تعمل  


///////////////
//  في هذا المثال نقوم بطباعه المتغيرات من النوع  برايفت وبروتيكتت

var_dump($user->sayed);
var_dump($user->aaa);

